# Data Science Class 3

## DataFrame
<p> - 2D data, that is rows and columns in the form of tables</p>

In [2]:
import pandas as pd

In [3]:
data = pd.DataFrame([12,23,56,45])

In [4]:
data

    0
0  12
1  23
2  56
3  45

In [5]:
data2 = pd.DataFrame([[12,23,34,45]])

In [6]:
data2

    0   1   2   3
0  12  23  34  45

In [7]:
data3 = pd.DataFrame([[12,23,34,45,56], [56,67,78,89,90]])

In [8]:
data3

    0   1   2   3   4
0  12  23  34  45  56
1  56  67  78  89  90

## DataFrame using Dictionary

In [46]:
df = pd.DataFrame({'Name': ['prachi', 'chaitnya', 'gunjan', 'ahnis', 'vani', 'muskan', 'mitanshi'], 'Age': [22, 22, 22, 23, 50, 21, 23], 'Class': ['Btech', 'Bca', 'Mtech', 'BCA', 'BCA', 'BCA', 'Mtech']})
df

       Name  Age  Class
0    prachi   22  Btech
1  chaitnya   22    Bca
2    gunjan   22  Mtech
3     ahnis   23    BCA
4      vani   50    BCA
5    muskan   21    BCA
6  mitanshi   23  Mtech

In [47]:
df.head()

       Name  Age  Class
0    prachi   22  Btech
1  chaitnya   22    Bca
2    gunjan   22  Mtech
3     ahnis   23    BCA
4      vani   50    BCA

In [48]:
df.head(3)

       Name  Age  Class
0    prachi   22  Btech
1  chaitnya   22    Bca
2    gunjan   22  Mtech

In [49]:
df.tail()

       Name  Age  Class
2    gunjan   22  Mtech
3     ahnis   23    BCA
4      vani   50    BCA
5    muskan   21    BCA
6  mitanshi   23  Mtech

In [50]:
df.tail(3)

       Name  Age  Class
4      vani   50    BCA
5    muskan   21    BCA
6  mitanshi   23  Mtech

In [51]:
df.shape

(7, 3)

## Accessing using []
<p>We can access the elements of the DataFrame using []. And this returs a Series of the elements in the mentioned column.</p>

In [52]:
df['Name']

0      prachi
1    chaitnya
2      gunjan
3       ahnis
4        vani
5      muskan
6    mitanshi
Name: Name, dtype: object

In [53]:
df['Age']

0    22
1    22
2    22
3    23
4    50
5    21
6    23
Name: Age, dtype: int64

In [54]:
df[['Name']]

       Name
0    prachi
1  chaitnya
2    gunjan
3     ahnis
4      vani
5    muskan
6  mitanshi

In [55]:
df[['Name', 'Age']]

       Name  Age
0    prachi   22
1  chaitnya   22
2    gunjan   22
3     ahnis   23
4      vani   50
5    muskan   21
6  mitanshi   23

In [56]:
df['Name'][:3] # [column name][row index]

0      prachi
1    chaitnya
2      gunjan
Name: Name, dtype: object

<p>This returns a Series of the elements whose column name is mentioned and upto or at which eindex is mentioned</p>

In [57]:
df[1:]

       Name  Age  Class
1  chaitnya   22    Bca
2    gunjan   22  Mtech
3     ahnis   23    BCA
4      vani   50    BCA
5    muskan   21    BCA
6  mitanshi   23  Mtech

## Accessing elements using .loc[] and .iloc[]

In [58]:
df.loc[:3,:] # loc[row index, column index]

       Name  Age  Class
0    prachi   22  Btech
1  chaitnya   22    Bca
2    gunjan   22  Mtech
3     ahnis   23    BCA

In [59]:
df.iloc[:3,:2] # iloc[row index, column index]

       Name  Age
0    prachi   22
1  chaitnya   22
2    gunjan   22

In [60]:
df.loc[:, 'Name'] # loc[row index, column name]
# this returns a Series of the Name column

0      prachi
1    chaitnya
2      gunjan
3       ahnis
4        vani
5      muskan
6    mitanshi
Name: Name, dtype: object

In [61]:
df.loc[:2,['Name','Class']] # loc[row index, [column names]]
# this returns a DataFrame of the Name and Class columns till label 2

       Name  Class
0    prachi  Btech
1  chaitnya    Bca
2    gunjan  Mtech

In [62]:
df.iloc[:,:2] # iloc[row inde, column index]
# this returns a DataFrame of the first two columns

       Name  Age
0    prachi   22
1  chaitnya   22
2    gunjan   22
3     ahnis   23
4      vani   50
5    muskan   21
6  mitanshi   23

In [63]:
df.loc[2,['Name','Class']] # loc[row index, [column names]]
# this returns an Object of the Name and Class columns at index 2

Name     gunjan
Class     Mtech
Name: 2, dtype: object

# Updating the DataFrame

In [64]:
df.loc[2,'Class']='Mtech'

In [65]:
df

       Name  Age  Class
0    prachi   22  Btech
1  chaitnya   22    Bca
2    gunjan   22  Mtech
3     ahnis   23    BCA
4      vani   50    BCA
5    muskan   21    BCA
6  mitanshi   23  Mtech

In [66]:
df.loc[:, 'Rollno'] = [1,2,3,4,5,6,7]

In [67]:
df

       Name  Age  Class  Rollno
0    prachi   22  Btech       1
1  chaitnya   22    Bca       2
2    gunjan   22  Mtech       3
3     ahnis   23    BCA       4
4      vani   50    BCA       5
5    muskan   21    BCA       6
6  mitanshi   23  Mtech       7

# Adding Column in DataFrame

In [68]:
df.loc[:,'Total Marks']=50

In [69]:
df

       Name  Age  Class  Rollno  Total Marks
0    prachi   22  Btech       1           50
1  chaitnya   22    Bca       2           50
2    gunjan   22  Mtech       3           50
3     ahnis   23    BCA       4           50
4      vani   50    BCA       5           50
5    muskan   21    BCA       6           50
6  mitanshi   23  Mtech       7           50

In [71]:
df.insert(loc=2,column='Marks',value=[45,43,46,44,39,30,20])

In [72]:
df

       Name  Age  Marks  Class  Rollno  Total Marks
0    prachi   22     45  Btech       1           50
1  chaitnya   22     43    Bca       2           50
2    gunjan   22     46  Mtech       3           50
3     ahnis   23     44    BCA       4           50
4      vani   50     39    BCA       5           50
5    muskan   21     30    BCA       6           50
6  mitanshi   23     20  Mtech       7           50

In [73]:
df.loc[:,'Percentage']= (df.loc[:,'Marks']/df.loc[:,'Total Marks'])*100

In [74]:
df

       Name  Age  Marks  Class  Rollno  Total Marks  Percentage
0    prachi   22     45  Btech       1           50        90.0
1  chaitnya   22     43    Bca       2           50        86.0
2    gunjan   22     46  Mtech       3           50        92.0
3     ahnis   23     44    BCA       4           50        88.0
4      vani   50     39    BCA       5           50        78.0
5    muskan   21     30    BCA       6           50        60.0
6  mitanshi   23     20  Mtech       7           50        40.0

In [76]:
df.loc[8,:]=['Nikhal',23,47,'bca',67,50,94]

In [77]:
df

       Name   Age  Marks  Class  Rollno  Total Marks  Percentage
0    prachi  22.0   45.0  Btech     1.0         50.0        90.0
1  chaitnya  22.0   43.0    Bca     2.0         50.0        86.0
2    gunjan  22.0   46.0  Mtech     3.0         50.0        92.0
3     ahnis  23.0   44.0    BCA     4.0         50.0        88.0
4      vani  50.0   39.0    BCA     5.0         50.0        78.0
5    muskan  21.0   30.0    BCA     6.0         50.0        60.0
6  mitanshi  23.0   20.0  Mtech     7.0         50.0        40.0
8    Nikhal  23.0   47.0    bca    67.0         50.0        94.0

# Conditions

In [78]:
df[df.loc[:,'Class']=='Btech']

     Name   Age  Marks  Class  Rollno  Total Marks  Percentage
0  prachi  22.0   45.0  Btech     1.0         50.0        90.0

In [80]:
df.loc[:,'Class']

0    Btech
1      Bca
2    Mtech
3      BCA
4      BCA
5      BCA
6    Mtech
8      bca
Name: Class, dtype: object

In [81]:
df[(df.loc[:,'Class']=='Btech') | (df.loc[:,'Percentage']>80)]

       Name   Age  Marks  Class  Rollno  Total Marks  Percentage
0    prachi  22.0   45.0  Btech     1.0         50.0        90.0
1  chaitnya  22.0   43.0    Bca     2.0         50.0        86.0
2    gunjan  22.0   46.0  Mtech     3.0         50.0        92.0
3     ahnis  23.0   44.0    BCA     4.0         50.0        88.0
8    Nikhal  23.0   47.0    bca    67.0         50.0        94.0

In [82]:
df[(df.loc[:,'Class']=='Btech') & (df.loc[:,'Percentage']>80)]

     Name   Age  Marks  Class  Rollno  Total Marks  Percentage
0  prachi  22.0   45.0  Btech     1.0         50.0        90.0